[
    {
        "id": 1,
        "phase": 1,
        "title": "Iron Man",
        "poster": "1jrg52Kxr5xTcV4THz6NgCTg8yKQKEHxj",
        "summary": " Iron Man tells the story of Tony Stark, a billionaire industrialist and genius inventor who is kidnapped and forced to build a devastating weapon. Instead, using his intelligence and ingenuity, Tony builds a high-tech suit of armor and escapes captivity. When he uncovers a nefarious plot with global implications, he dons his powerful armor and vows to protect the world as Iron Man.",
        "release": "May 2, 2008",
        "year": 2008,
        "duration": "2h 06m",
        "rating": 4.8
    },
    {
        "id": 2,
        "phase": 1,
        "title": "The Incredible Hulk",
        "poster": "15r1xEWugpeAmm1EEe2wnlQkKR8DYalHC",
        "summary": "In this new beginning, scientist Bruce Banner desperately hunts for a cure to the gamma radiation that poisoned his cells and unleashes the unbridled force of rage within him: The Hulk. Living in the shadows--cut off from a life he knew and the woman he loves, Betty Ross--Banner struggles to avoid the obsessive pursuit of his nemesis, General Thunderbolt Ross and the military machinery that seeks to capture him and brutally exploit his power. As all three grapple with the secrets that led to the Hulk's creation, they are confronted with a monstrous new adversary known as the Abomination, whose destructive strength exceeds even the Hulk's own. One scientist must make an agonizing final choice: accept a peaceful life as Bruce Banner or find heroism in the creature he holds inside--The Incredible Hulk.",
        "release": "June 13, 2008",
        "year": 2008,
        "duration": "1h 52m",
        "rating": 4.1
    },
    { 
        "id": 3,
        "phase": 1,
        "title": "Iron Man 2",
        "poster": "1XIAS1Y3G4ocOEQtskP9wwaRdP3HizslO",
        "summary": "With the world now aware that he is Iron Man, billionaire inventor Tony Stark faces pressure from all sides to share his technology with the military. He is reluctant to divulge the secrets of his armored suit, fearing the information will fall into the wrong hands. With Pepper Potts and 'Rhodey' Rhodes by his side, Tony must forge new alliances and confront a powerful new enemy.",
        "release": "May 7, 2010",
        "year": 2010,
        "duration": "2h 04m",
        "rating": 4.3
    },
    {
        "id": 4,
        "phase": 1,
        "title": "Thor",
        "poster": "1wTAQjNwTVS8mIkw25AoGYEOTC266sdwk",
        "summary": "As the son of Odin, king of the Norse gods, Thor will soon inherit the throne of Asgard from his aging father. However, on the day that he is to be crowned, Thor reacts with brutality when the gods' enemies, the Frost Giants, enter the palace in violation of their treaty. As punishment, Odin banishes Thor to Earth. While Loki, Thor's brother, plots mischief in Asgard, Thor, now stripped of his powers, faces his greatest threat.",
        "release": "May 6, 2011",
        "year": 2011,
        "duration": "1h 55m",
        "rating": 4.2
    },
    {
        "id": 5,
        "phase": 1,
        "title": "Captain America the First Avenger",
        "poster": "1AP2SpMr9oyZC4jZcx71_5xkHVjDceqrh",
        "summary": "Steve Rogers, a rejected military soldier, transforms into Captain America after taking a dose of a 'Super-Soldier serum'. But being Captain America comes at a price as he attempts to take down a warmonger and a terrorist organization.",
        "release": "July 22, 2011",
        "year": 2011,
        "duration": "2h 04m",
        "rating": 4.6
    },
    {
        "id": 6,
        "phase": 1,
        "title": "The Avengers",
        "poster": "1_H6xIP20O0REOmrj3h8r4QHWTWHgCyUd",
        "summary": "The super hero team up of a lifetime, featuring iconic Marvel super heroes Iron Man, the Incredible Hulk, Thor, Captain America, Hawkeye and Black Widow. When an unexpected enemy emerges that threatens global safety and security, Nick Fury, Director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins.",
        "release": "May 4, 2012",
        "year": 2012,
        "duration": "2h 23m",
        "rating": 4.7
    },
    {
        "id": 7,
        "phase": 2,
        "title": "Iron Man 3",
        "poster": "1SN801qeC0zB8PreIRGY6yL9x8ZHbeuxA",
        "summary": "Brash-but-brilliant industrialist Tony Stark/Iron Man against an enemy whose reach knows no bounds. When Stark finds his personal world destroyed at his enemy's hands, he embarks on a harrowing quest to find those responsible. This journey, at every turn, will test his mettle. With his back against the wall, Stark is left to survive by his own devices, relying on his ingenuity and instincts to protect those closest to him. As he fights his way back, Stark discovers the answer to the question that has secretly haunted him: does the man make the suit or does the suit make the man",
        "release": "May 3, 2013",
        "year": 2013,
        "duration": "2h 10m",
        "rating": 3.5
    },
    {
        "id": 8,
        "phase": 2,
        "title": "Thor: The Dark World",
        "poster": "1jQdqUFuIO2nUha-8aUheZXcACoSl4Z8n",
        "summary": "In the aftermath of Marvel's 'Thor' and 'Marvel's The Avengers', Thor fights to restore order across the cosmos...but an ancient race led by the vengeful Malekith returns to plunge the universe back into darkness. Faced with an enemy that even Odin and Asgard cannot withstand, Thor must embark on his most perilous and personal journey yet, one that will reunite him with Jane Foster and force him to sacrifice everything to save us all.",
        "release": "November 8, 2013",
        "year": 2013,
        "duration": "1h 52m",
        "rating": 3.6
    },
    {
        "id": 9,
        "phase": 2,
        "title": "Captain America: The Winter Soldier",
        "poster": "18mYcaJBM1Nyt_iW-ewY4SZfyTPIq64Ol",
        "summary": "After the cataclysmic events in New York with The Avengers, Marvel's 'Captain America: The Winter Soldier,' finds Steve Rogers, aka Captain America, living quietly in Washington, D.C. and trying to adjust to the modern world. But when a S.H.I.E.L.D. colleague comes under attack, Steve becomes embroiled in a web of intrigue that threatens to put the world at risk. Joining forces with the Black Widow, Captain America struggles to expose the ever-widening conspiracy while fighting off professional assassins sent to silence him at every turn. When the full scope of the villainous plot is revealed, Captain America and the Black Widow enlist the help of a new ally, the Falcon. However, they soon find themselves up against an unexpected and formidable enemy--the Winter Soldier.",
        "release": "April 4, 2014",
        "year": 2014,
        "duration": "2h 16m",
        "rating": 4.8
    },
    {
        "id": 10,
        "phase": 2,
        "title": "Guardians of the Galaxy",
        "poster": "1nv1XUI31MYp6nEJ7m56NsN2m6Xy3_VwE",
        "summary": "Brash adventurer Peter Quill finds himself the object of an unrelenting bounty hunt after stealing a mysterious orb coveted by Ronan, a powerful villain with ambitions that threaten the entire universe. To evade the ever-persistent Ronan, Quill is forced into an uneasy truce with a quartet of disparate misfits--Rocket, a gun-toting raccoon; Groot, a tree-like humanoid; the deadly and enigmatic Gamora; and the revenge-driven Drax the Destroyer. But when Quill discovers the true power of the orb and the menace it poses to the cosmos, he must do his best to rally his ragtag rivals for a last, desperate stand--with the galaxy's fate in the balance.",
        "release": "August 1, 2014",
        "year": 2014,
        "duration": "2h 01m",
        "rating": 4.6
    },
    {
        "id": 11,
        "phase": 2,
        "title": "Avengers: Age of Ultron",
        "poster": "1azb41M3vM-OOnWTjzs1_Ep18mxNb1wON",
        "summary": "When Tony Stark and Bruce Banner try to jumpstart a dormant peacekeeping program, things go awry and Earth’s Mightiest Heroes, including Iron Man, Captain America, Thor, The Incredible Hulk, Black Widow and Hawkeye, are put to the ultimate test as the fate of the planet hangs in the balance. As the villainous Ultron emerges, it is up to the Avengers to stop him from enacting his terrible plans, and soon uneasy alliances and unexpected action pave the way for an epic and unique global adventure.",
        "release": "May 1, 2015",
        "year": 2015,
        "duration": "2h 21m",
        "rating": 4.4
    },
    {
        "id": 12,
        "phase": 2,
        "title": "Ant-Man",
        "poster": "1WJgiHTzlfFv6y2NLm0zkGn501NayXgJW",
        "summary": "AArmed with the astonishing ability to shrink in scale but increase in strength, master thief Scott Lang must embrace his inner-hero and help his mentor, Doctor Hank Pym, protect the secret behind his spectacular Ant-Man suit from a new generation of towering threats. Against seemingly insurmountable obstacles, Pym and Lang must plan and pull off a heist that will save the world.",
        "release": "July 17, 2015",
        "year": 2015,
        "duration": "1h 57m",
        "rating": 4.4
    },
    {
        "id": 13,
        "phase": 3,
        "title": "Captain America Civil War",
        "poster": "1eBnLRC6jIvfnYf3ekGj-wICOB0ZrWNLk",
        "summary": "Steve Rogers leads the newly formed team of Avengers in their continued efforts to safeguard humanity. But after another incident involving the Avengers results in collateral damage, political pressure mounts to install a system of accountability, headed by a governing body to oversee and direct the team. The new status quo fractures the Avengers, resulting in two camps—one led by Steve Rogers and his desire for the Avengers to remain free to defend humanity without government interference, and the other following Tony Stark’s surprising decision to support government oversight and accountability.",
        "release": "May 6, 2016",
        "year": 2016,
        "duration": "2h 27m",
        "rating": 4.6
    },
    {
        "id": 14,
        "phase": 3,
        "title": "Doctor Strange",
        "poster": "1M885okad-UESNqr14MW5c1eQz0jMUFNP",
        "summary": "The story of world-famous neurosurgeon Dr. Stephen Strange whose life changes forever after a horrific car accident robs him of the use of his hands. When traditional medicine fails him, he is forced to look for healing, and hope, in an unlikely place—a mysterious enclave known as Kamar-Taj. Before long Strange—armed with newly acquired magical powers—is forced to choose whether to return to his life of fortune and status or leave it all behind to defend the world as the most powerful sorcerer in existence.",
        "release": "November 4, 2016",
        "year": 2016,
        "duration": "1h 55m",
        "rating": 4.5
    },
    {
        "id": 15,
        "phase": 3,
        "title": "Guardians of the Galaxy Vol.2",
        "poster": "1sILp0Z8ZGH-eydRmxDeIPNGOR_pD_hLp",
        "summary": "Peter Quill and his fellow Guardians are hired by a powerful alien race, the Sovereign, to protect their precious batteries from invaders. When it is discovered that Rocket has stolen the items they were sent to guard, the Sovereign dispatch their armada to search for vengeance. As the Guardians try to escape, the mystery of Peter's parentage is revealed.",
        "release": "May 5, 2017",
        "year": 2017,
        "duration": "2h 16m",
        "rating": 4.4
    },
    {
        "id": 16,
        "phase": 3,
        "title": "Spider-Man Homecoming",
        "poster": "1KkrtwlGqnld_t8ZsTjwy5lwqgLOvgjoA",
        "summary": "A young Peter Parker/Spider-Man, who made his sensational debut in Captain America: Civil War, begins to navigate his newfound identity as the web-slinging super hero in Spider-Man: Homecoming. Thrilled by his experience with the Avengers, Peter returns home, where he lives with his Aunt May, under the watchful eye of his new mentor Tony Stark. Peter tries to fall back into his normal daily routine—distracted by thoughts of proving himself to be more than just your friendly neighborhood Spider-Man—but when the Vulture emerges as a new villain, everything that Peter holds most important will be threatened.",
        "release": "July 7, 2017",
        "year": 2017,
        "duration": "2h 13m",
        "rating": 4.0
    },
    {
        "id": 17,
        "phase": 3,
        "title": "Thor Ragnarok",
        "poster": "1yEpbMTtGTlwnuJj8qn5_jr_JkI44vSb5",
        "summary": "Thor is imprisoned on the other side of the universe without his mighty hammer and finds himself in a race against time to get back to Asgard to stop Ragnarok—the destruction of his homeworld and the end of Asgardian civilization—at the hands of an all-powerful new threat, the ruthless Hela. But first he must survive a deadly gladiatorial contest that pits him against his former ally and fellow Avenger—the Incredible Hulk!",
        "release": "November 3, 2017",
        "year": 2017,
        "duration": "2h 10m",
        "rating": 4.3
    },
    {
        "id": 18,
        "phase": 3,
        "title": "Black Panther",
        "poster": "1HyuP4Nhy3vY3pWdDdux_6VNGqDC_BWUw",
        "summary": "“Black Panther” follows T’Challa who, after the death of his father, the King of Wakanda, returns home to the isolated, technologically advanced African nation to succeed to the throne and take his rightful place as king. But when a powerful old enemy reappears, T’Challa’s mettle as king —and Black Panther— is tested when he is drawn into a formidable conflict that puts the fate of Wakanda and the entire world at risk. Faced with treachery and danger, the young king must rally his allies and release the full power of Black Panther to defeat his foes and secure the safety of his people and their way of life.",
        "release": "February 16, 2018",
        "year": 2018,
        "duration": "2h 14m",
        "rating": 4.6
    },
    {
        "id": 19,
        "phase": 3,
        "title": "Avengers Infinity War",
        "poster": "1v9R8sAm4Y9OCL2V2LBnPQByS7SIUrGSE",
        "summary": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain",
        "release": "April 27, 2018",
        "year": 2018,
        "duration": "2h 29m",
        "rating": 4.7
    },
    {
        "id": 20,
        "phase": 3,
        "title": "Ant-Man and The Wasp",
        "poster": "1CZWv0Nqwn-e-qQV9qHWUavNZeQ0NvtAE",
        "summary": "In the aftermath of “Captain America: Civil War,” Scott Lang grapples with the consequences of his choices as both a Super Hero and a father. As he struggles to rebalance his home life with his responsibilities as Ant-Man, he’s confronted by Hope van Dyne and Dr. Hank Pym with an urgent new mission. Scott must once again put on the suit and learn to fight alongside The Wasp as the team works together to uncover secrets from their past.",
        "release": "July 6, 2018",
        "year": 2018,
        "duration": "1h 58m",
        "rating": 4.2
    },
    {
        "id": 21,
        "phase": 3,
        "title": "Captain Marvel",
        "poster": "1h_9QZpxC0zowBYC89sUvD1UR6BxG8RPK",
        "summary": "Set in the 1990s, Marvel Studios’ “Captain Marvel” is an all-new adventure from a previously unseen period in the history of the Marvel Cinematic Universe that follows the journey of Carol Danvers as she becomes one of the universe’s most powerful heroes. While a galactic war between two alien races reaches Earth, Danvers finds herself and a small cadre of allies at the center of the maelstrom.",
        "release": "March 8, 2019",
        "year": 2019,
        "duration": "2h 03m",
        "rating": 2.8
    },
    {
        "id": 22,
        "phase": 3,
        "title": "Avengers Endgame",
        "poster": "1lxuwvUCYwqXgKEHNIr5W-MU5OiYgKUIk",
        "summary": "After the devastating events of Avengers: Infinity War (2018), the universe is in ruins. With the help of remaining allies, the heroes discover one final chance to make things right, assembling once more in order to reverse Thanos' actions and restore balance to the universe. Journeying back through space and time, the surviving Avengers attempt to stop Thanos before all is lost.",
        "release": "April 26, 2019",
        "year": 2019,
        "duration": "3h 01m",
        "rating": 4.7
    },
    {
        "id": 23,
        "phase": 3,
        "title": "Spider-Man Far From Home",
        "poster": "1U2aoN589IJmgFT1l8pzWBsXq9I1VGtw4",
        "summary": "Following the events of Avengers: Endgame, Spider-Man must step up to take on new threats in a world that has changed forever. Peter Parker faces four destructive elemental monsters while on holiday in Europe. Soon, he receives help from Mysterio, a fellow hero with mysterious origins.",
        "release": "July 2, 2019",
        "year": 2019,
        "duration": "2h 09m",
        "rating": 4.0
    }
]